app/controllers/sessions_controller.rb

INSERT INTO "users" ("uid", "name", "email") VALUES (?, ?, ?)  [["uid", "10210054548174131"], ["name", "John Shelby"], ["email", "johnshelby@yahoo.com"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1"]]
---
    def create
      user = User.find_or_create_by(:uid => auth['uid']) do |u|